In [1]:
import pandas as pd

In [ ]:
growth = pd.Series([143,150,157,160],index=["2018","2019","2020","2021"])
growth

2018    143
2019    150
2020    157
2021    160
dtype: int64

In [3]:
growth["2018"]

143

In [14]:
growth = pd.Series([143,150,157,160],name = "신장")
growth

0    143
1    150
2    157
3    160
Name: 신장, dtype: int64

In [7]:
index=["2018","2019","2020","2021"]

Yeonghee = pd.Series([143,150,157,160],index = index)
Cheolsu = pd.Series([165,172,175,180],index=index)

growth = pd.DataFrame({
    '영희': Yeonghee,
    '철수' : Cheolsu
})

growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [8]:
index=["2018","2019","2020","2021"]

data = {
    '영희':[143,150,157,160],
    '철수':[165,172,175,180]
}

growth = pd.DataFrame(data,columns=['영희','철수'],index=index)

growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [10]:
print(growth.dtypes)

영희    int64
철수    int64
dtype: object

In [11]:

growth.astype('float') # 임시로 바꿈 바꾸려면 a =growth.astype('float') 해야함

         영희     철수
2018  143.0  165.0
2019  150.0  172.0
2020  157.0  175.0
2021  160.0  180.0

In [13]:

growth.astype({'영희':'float'})

         영희   철수
2018  143.0  165
2019  150.0  172
2020  157.0  175
2021  160.0  180

In [19]:
pd.read_csv("csv_test.csv")

   Unnamed: 0   A   B  C
0           0  30  21  9
1         100   2   3  4

In [18]:
pd.read_csv("csv_test.csv",index_col=0)

      A   B  C
0    30  21  9
100   2   3  4

In [20]:
print(growth)

0    143
1    150
2    157
3    160
Name: 신장, dtype: int64

In [23]:
growth.to_csv("output.csv",index=False)

In [30]:
index=["2018","2019","2020","2021"]

data = {
    '영희':[143,150,157,160],
    '철수':[165,172,175,180],
    '영철':[165,123,180,175]
}

growth = pd.DataFrame(data,columns=['영희','철수','영철'],index=index)

growth

       영희   철수   영철
2018  143  165  165
2019  150  172  123
2020  157  175  180
2021  160  180  175

In [57]:
growth.영희[0]

C:\Users\ckddl\AppData\Local\Temp\ipykernel_28636\3713450970.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  growth.영희[0]

143

In [50]:
growth.영희[:1]

2018    143
Name: 영희, dtype: int64

In [47]:
growth.iloc[:2,:2]

       영희   철수
2018  143  165
2019  150  172

In [67]:
growth.iloc[:1,:3]

       영희   철수   영철
2018  143  165  165

In [56]:
growth.loc["2018","영희"]

143

In [68]:
growth.set_index("영희")

      철수   영철
영희
143  165  165
150  172  123
157  175  180
160  180  175

In [69]:
growth.loc[growth.영희 >=150]

       영희   철수   영철
2019  150  172  123
2020  157  175  180
2021  160  180  175

In [72]:
index=["영희","철수","영철"]

data = {
    '2018':[143,150,157],
    '2019':[165,172,175],
    '2020':[165,123,180]
}

growth = pd.DataFrame(data,index=index)

growth

    2018  2019  2020
영희   143   165   165
철수   150   172   123
영철   157   175   180

In [82]:
growth.loc[growth['2018'] == 150]

    2018  2019  2020
철수   150   172   123

In [83]:
growth["2019"]>170

영희    False
철수     True
영철     True
Name: 2019, dtype: bool

In [84]:
growth["2019"] = 190

In [85]:
print(growth)

    2018  2019  2020
영희   143   190   165
철수   150   190   123
영철   157   190   180

In [86]:
growth["2021"]= 200

In [87]:
print(growth)

    2018  2019  2020  2021
영희   143   190   165   200
철수   150   190   123   200
영철   157   190   180   200

In [91]:
growth["거꾸로"]=range(len(growth),0,-1)
growth

    2018  2019  2020  2021  거꾸로
영희   143   190   165   200    3
철수   150   190   123   200    2
영철   157   190   180   200    1